In [6]:
import pandas as pd 
lista_mercado =pd.Series({'Arroz':4200,
                  'Carne':4800,
                  'Pan':5400,
                  'Cereal':2200,
                  'Gomitas':2300,
                  'Queso':3000,
                  'Jamon':2500,
                  'Avena': 3100,
                  'Bananos':2000,
                  'Papas': 2600})
print(lista_mercado)

Arroz      4200
Carne      4800
Pan        5400
Cereal     2200
Gomitas    2300
Queso      3000
Jamon      2500
Avena      3100
Bananos    2000
Papas      2600
dtype: int64

In [10]:
import pandas as pd 
business_results_frame= pd.DataFrame({'Enero':[2000,1000,1200,2000,3000],
                  'Febrero':[2300,1200,1300,4500,4000],
                  'Marzo':[2400,1600,1400,3200,3000],
                  'Abril':[1000,600,600,800,700]},index=['Arroz','carne','Pan','cereal','gomitas'])
business_results_frame

         Enero  Febrero  Marzo  Abril
Arroz     2000     2300   2400   1000
carne     1000     1200   1600    600
Pan       1200     1300   1400    600
cereal    2000     4500   3200    800
gomitas   3000     4000   3000    700

In [11]:
import pandas as pd 
business_results_frame= pd.DataFrame({'Enero':[2000,1000,1200,2000,3000],
                  'Marzo':[2400,1600,1400,3200,3000],
                   },index=['Arroz','carne','Pan','cereal','gomitas'])
business_results_frame

         Enero  Marzo
Arroz     2000   2400
carne     1000   1600
Pan       1200   1400
cereal    2000   3200
gomitas   3000   3000

In [12]:
import pandas as pd 
business_results_frame= pd.DataFrame({'Abril':[1000,600,600,800,700]},index=['Arroz','carne','Pan','cereal','gomitas'])
business_results_frame

         Abril
Arroz     1000
carne      600
Pan        600
cereal     800
gomitas    700